import React from "react";

function Croatia() {
  return (
    <div
      style={{
        textAlign: "justify",
        display: "flex",
        flexDirection: "column",
        gap: "25px",
      }}
    >
      <p>
        Первый раз я приехала в Хорватию в 2016 году и с того момента <b>влюбилась
        в эту страну</b>. Мне безумно нравится климат Хорватии, менталитет этих
        людей, их любовь к футболу. Страна очень мне подходит.
      </p>
      <p>
        В 2020 году я <b>перевела с хорватского языка на русский</b> фильм ZG80, про
        выезд фанатов Динамо Загреб в Сербию на игру с Црвеной Звездой.
      </p>
      <p>
        За все эти годы у меня появились друзья в Загребе, Сплите, Осиеке,
        Дубровнике. <b>Я выучила хорватский язык</b>, даже занималась с репетитором.
      </p>
      <div style={{ display: "flex", justifyContent: "center" }}>
        <img
          style={{ width: "400px", padding: "22px" }}
          src="/Loko.jpeg"
          alt="Loko"
        />
      </div>
      <p>
        В твиттере я подружилась с футбольным клубом Локомотивой Загреб, и
        СММ-менеджер с аккаунта клуба лайкал мои посты про Локомотиву :)
      </p>
      <div style={{ display: "flex", justifyContent: "center" }}>
        <img
          style={{ width: "700px", padding: "22px" }}
          src="/Train.jpeg"
          alt="Train"
        />
      </div>
      <p>
        В 2023 году я приняла решение активно заняться переездом, но мои планы
        разбились о поиск работы в Хорватии.
      </p>
      <p>
        В феврале 2024 года я откликнулась на вакансию Frontend-разработчика
        одной IT-компании из Загреба. Требуемый стек технологий идеально
        подходил под мой. Через пару дней на почту мне пришло соглашение о
        неразглашении и <b>приглашение на собеседование</b>.
      </p>
      <p>
        Я была безумно счастлива и готовилась буквально днями и ночами. Я смогла
        на хорватском рассказать и про event-loop, про замыкания, про все на
        свете.
      </p>
      <div style={{ display: "flex", justifyContent: "center" }}>
        <img
          style={{ width: "400px", padding: "22px" }}
          src="/Lang.jpeg"
          alt="Croatian_lang"
        />
      </div>
      <p>
        Это было очень интересное собеседование. Мы разговаривали о моем опыте,
        о технологиях, были психологические вопросы. Все собеседование длилось
        40 минут, и оно было на хорватском языке. В конце HR меня очень
        похвалила, но ее смутило, что я в России, и что мой переезд может занять
        по ее опыту 4 месяца. Мне пришел отказ.
      </p>
      <p>Я очень расстроилась, но решила, что буду стараться дальше. На момент поиска работы я уже нашла жилье в Загребе около стадиона Локомотивы, но работу в Хорватии оказалось непросто найти</p>
      <div style={{ display: "flex", justifyContent: "center" }}>
        <img
          style={{ width: "400px", padding: "22px" }}
          src="/Lokomotiva.jpeg"
          alt="Lokomotiva"
        />I love you anyway
      </div>
    </div>
  );
}

export default Croatia;
