import React from "react";

function Doggy() {
  return (
    <div>
      <p style={{ textAlign: "justify" }}>
        <b>
          "Извините, я почему граундхоппером был — потому что у меня собаки не
          было!"
        </b>
        <br />
        <br />
        Давайте начнем с того, что вообще это такое — <b>граундхоппинг</b> и с
        чем его едят.
        <br />
        <br />
        Немецкие читатели моего сайта сейчас бы вам сказали: с пивом и
        колбасками!
        <br />
        <br />
        Граундхоппинг — это футбольные путешествия без привязки к конкретному
        клубу. В выборе матча такие путешественники как правило отталкиваются от
        того, насколько интересная будет игра: будут ли у команд болельщики,
        чтобы послушать их песни, увлекательна ли история клуба, ну и конечно
        красота самого стадиона.
        <br />
        <br />
        Сам футбол в такой истории мало кого интересует, но я знакома с
        граундхопперами, которые действительно смотрят матч с первой до
        последней минутки и оценивают саму игру и переживают :)
        <br />
        <br />
        Это и логично, все-таки все мы собрались по одному поводу — футбол,
        поэтому интуитивно на один часик начинаешь "притапливать" за более
        симпотичный тебе клуб.
        <br />
        <br />
        <b>Откуда берется граундхоппер? </b>
        <br />
        <br />
        Как правило это футбльный болельщик, который на протяжении своей жизни
        объездил за своим клубом множество городов и стран и каждый выезд уже
        стал утомительным и неинтересным.
        <div style={{ display: "flex", padding: "22px 0", gap: 22 }}>
          <span
            style={{
              display: "flex",
              flexDirection: "column",
              justifyContent: "center",
            }}
          >
            Каждый год ничего не меняется: Питер, Тула, Ростов, Самара,
            Казань...
            <br />
            <br />
            <span>
              Мне очень нравится каждый из этих городов, но мне уже просто
              нечего в них смотреть. Вот так и придумывается себе новое занятие
              связанное с любимым увлечением — <b>граундхоппинг</b>.
            </span>
            <br />
            <br />
            Пару лет назад я поехала на выезд за свой Локомотив в
            Санкт-Петербург, а вернулась на игру Локо в Химки без заезда в
            Москву (по сути двойник).
            <br />
            <br />
            <span>
              За эту поездку я посетила <b>10 футбольных матчей </b>по
              Ленинградской и Тверской областям.
            </span>
            <br />
            <br />
            <b>
              Моя статья про один из этих матчей была напечатана в книге по
              граундхоппингу.
            </b>
          </span>
          <img style={{ width: "350px" }} src="/GhBook.jpeg" alt="Book" />
        </div>
        На сегодняшний день я посетила{" "}
        <b>более ста уникальных футбольных стадионов</b> с матчами на них, и я
        вхожу в <b>топ 100</b> граундхопперов России. В 2021 году я
        присоединилась к Русской лиге граундхопперов.
        <img
          style={{ width: " -webkit-fill-available", padding: "22px 0" }}
          src="/GH.png"
          alt="Gh"
        />
        Но! Как выразился мой бывший руководитель <b>"Купила баба порося!"</b>.
        <br />
        <br />
        В августе 2023 я стала счастливой обладательницей маленькой рыжей
        лисицы. И на этом мои путешествия заигали новыми красками.
        <br />
        <br />
        В кратчайшие сроки я начала знакомить Оскара с футболом. Создала Оски
        аккаунт на сайте graundhopper.ru и начался новый квест.
        <br />
        <br />
        Теперь мне нужно отталкиваться не только от вышеупомянутых фактров при
        выборе игры, а еще ориентироваться на <b>Dog Frendly</b> стадионы, а
        таких, к сожалению, практически нет :(
        <div style={{ display: "flex", padding: "22px 0", gap: 22 }}>
          <img
            style={{ width: "350px" }}
            src="/Metallist.jpeg"
            alt="Metallist"
          />

          <span
            style={{
              display: "flex",
              flexDirection: "column",
              justifyContent: "center",
            }}
          >
            Первым матчем в жизни Оскара стала игра Металлиста из города
            Королев. Несмотря на развешанные по всему стадиону таблички о
            запрете посещения игр собаками, Оски попал на территорию свободно и
            смог посмотреть футбол.
            <br />
            <br />
            Мое хобби стало еще увлекательнее. У меня идеальная для путешествий
            собака, и Оски уже съездил со мной в соседнюю страну — Беларусь.
            <br />
            <br />
            Самое потрясающее, что я вижу, что моей лисице это все очень нравится. 
            <br />
            <br />
            <b>Дальше — больше!</b>
          </span>
        </div>
      </p>
    </div>
  );
}

export default Doggy;
