{
  "hr": {
    "translation": {
      "main": {
        "hello": "KATJA MARČENKO",
        "katya": "Katja",
        "frontendDeveloper": "FRONTEND DEVELOPER",
        "welcome": "Dobrodošli na moj web portfelj",
        "im": "Ja sam front-end programer koji voli stvarati nešto novo i drugačije.",
        "more": "više detalja",
        "talk": "Pricamo?"
      },
      "header": {
        "aboutMe": "O meni",
        "contacts": "Kontakti",
        "projects": "Projekti",
        "pet": "Osobni projekti"
      },
      "work": {
        "position": "Pozicija",
        "period": "Razdoblje",
        "sphere": "Podrucje",
        "title": "Ključna postignuća i odgovornosti:",
        "ic8": {
          "position": "Viši programer",
          "first": "Razvijen novi proizvod \"Administracijska ploča\" za upravljanje tarifama i online tarifiranje",
          "second": "Unaprijeđen proizvod za servisne zahtjeve i upravljanje timovima",
          "third": "Razvijena nova web verzija proizvoda za korištenje tarifnih planova širokopojasnog interneta s implementacijom tehnologije Tanstack Query"
        },
        "fgk": {
          "position": "Programer",
          "first": "Razvoj i dizajn korisničkih sučelja za nadzorne ploče menadžera i klijenata, korištenjem Vue.js.",
          "second": "Implementiran responzivan, intuitivan dizajn koji poboljšava korisničko iskustvo i povećava produktivnost menadžera.",
          "third": "Samostalan razvoj i optimizacija backenda. Poboljšana arhitektura poslužiteljske strane, optimizirani upiti za bazu podataka i API, osiguravajući visoke performanse i pouzdanost sustava.",
          "fourth": "Izrada integriranog razvojnog okruženja (IDE) pomoću Vue.js za internu upotrebu od strane tima menadžera. Ova platforma ubrzala je proces izračuna."
        },
        "qwep": {
          "position": "Frontend programer",
          "first": "Potpuna prerada i pokretanje nove web verzije platformnih aplikacija, dovršeno u timu s kolegom programerom. Projekt je uključivao prepisivanje aplikacija od nule, što je rezultiralo poboljšanim performansama, modernim korisničkim sučeljem i većom skalabilnošću sustava.",
          "second": "Razvoj dodatnih funkcionalnosti za aplikacije kao kontinuirani zadatak."
        }
      },
      "footer": {
        "info": "Radim u području razvoja softvera već pet godina i sa svakim projektom nastojim implementirati nove tehnologije i pratiti aktualne trendove u industriji. To mi pomaže da ostanem u vrhu inovativnih rješenja."
      },
      "drawer": {
        "myHome": "Soba",
        "settings": "Postavke",
        "changeTheme": "Odaberite temu"
      },
      "aboutMe": {
        "name": "Ime:",
        "Ekaterina": "Ekaterina",
        "city": "Grad:",
        "Moscow": "Moskva",
        "education": "Obrazovanje:",
        "higher": "Više",
        "years": "Dob:",
        "zodiac": "Zodijački znak:",
        "capricorn": "Jarac",
        "spec": "Specijalizacija:",
        "programer": "Programer"
      },
      "card": {
        "ic8": "IC8",
        "sphere": "Područje:",
        "whatDoing": "Što sam radila:",
        "ic8Do": "U 2024. godini razvijala sam aplikaciju za tehničke stručnjake za upravljanje timovima i pokrenuli smo novu web verziju proizvoda za korištenje širokopojasnog interneta.",
        "fgk": "Federal Freight Company",
        "fgkDo": "Razvijala sam nadzorne ploče za menadžere i klijente, samostalno sam dorađivala backend. Otkrila sam Vue u komercijalnom razvoju i napisala IDE koristeći ga.",
        "qwep": "qwep",
        "qwepDo": "U 2023. godini prepisali smo aplikacije platforme od nule i uspješno pokrenuli novu web verziju. Nastavljam razvijati funkcionalnost aplikacija QWEP uz glavni posao."
      },
      "story": {
        "work": "«Znaš da ćeš biti mega senjorka»",
        "kanal": "2022. pokrenula je najunikatniji IT kanal «Что-то на джуновском» (“Something in Junior”)",
        "shiba": "Vladar lokalnih digitalnih zemalja i lisica",
        "croatia": "Glavni zivotni cilj je preseliti se u Hrvatsku",
        "Work": {
          "start": "Istražujući svoje korijene, vrijedno je spomenuti da sam rođena u Moskvi, na petak trinaesti, i da sam se tijekom djetinjstva bavila računalima zajedno sa svojom braćom. Moj najstariji brat je profesor informatike. Drugi je inženjer sigurnosti.",
          "education": "U školi sam pohađala razred s naglaskom na <b>fiziku i matematiku</b>. Visokoškolsko obrazovanje stekla sam na Ruskom sveučilištu za kooperaciju, gdje sam diplomirala s odličnim uspjehom.",
          "js": "Također sam uspješno završila školu programiranja i stekla diplomu <b>JavaScript programera</b>.",
          "frontend": "Već oko <b>pet godina</b> se aktivno razvijam u struci. Volim preuzimati dodatne projekte i kontinuirano se usavršavam.",
          "lib": "Moj prvi osobni projekt bila je elektronička knjižnica. trebalo mi je nešto čime bih se mogla zaposliti, pa sam počela pisati.",
          "friend": "Ovu ideju predložili su moji prijatelji:",
          "whantLib": "«Želimo svoje knjige objavljivati online i rezervirati ih!».",
          "app": "Aplikacija omogućava registraciju, objavljivanje vlastitih knjiga, te pronalazak i rezervaciju knjiga koje vas zanimaju. Možete ostaviti komentar na knjigu ili jednostavno dati ocjenu.",
          "deploy": "Dizajn sam razvila samostalno, bez korištenja biblioteka za korisničko sučelje. Povezala sam bazu podataka, projekt lansirala na Heroku i “voila”",
          "offer": "Prva ponuda već je u mom džepu!",
          "dontStop": "Nisam se zaustavila na tome, nastavila sam učiti nove tehnologije i stvarati zanimljive stvari.",
          "fgk": "Jedno od značajnih iskustava za mene bilo je raditi u <b>Federal Freight Company</b> (Glavna podružnica Ruskog željezničkog prometa).",
          "backend": "U FFC-u sam razvijala račune za menadžere i klijente, imala priliku učiti PHP i Laravel te <b>samostalno raditi na back-endu</b>.",
          "vue": "Otkrila sam Vue u komercijalnom razvoju i napisala IDE koristeći ga.",
          "qwep": "Sada sam se vratila na React, pored glavnog posla, te nastavljam pridonositi razvoju funkcionalnosti aplikacije QWEP. U 2023. godini smo aplikaciju ponovno napisali iz nule i uspješno isporučili",
          "newWeb": "novu web verziju."
        },
        "Kanal": {
          "name": "ime",
          "theme": "tema",
          "it": "IT, obrazovanje i humor",
          "quantity": ">700 ljudi",
          "devis": "Terry Davis u suknji",
          "audience": "publika",
          "slogan": "slogan",
          "kanal": "Kako god to zvučalo, trenutno mi je najvažniji moj kanal. To je moja ideja!",
          "save": "Jednoga dana sam došla na ideju da počnem voditi bilješke u Telegramu. Stvorila sam privatni kanal gdje sam pohranila korisne IT linkove, članke i zanimljive projekte. Također sam zapisivala osobne bilješke i komentare.",
          "story": "Iznenađujuće, kanal je počeo privlačiti pretplatnike i tada sam odlučila da ću kroz njega dijeliti svoje priče, dostignuća i događanja s posla dok stječem iskustvo.",
          "qweez": "Kad je broj pretplatnika dosegao <b>500</b>, jasno se definirala publika i čak se formirala prava zajednica. Pojavili su se lokalni memovi, počeli smo organizirati kvizove na kanalu, uključujući i one koje predlažu pretplatnici. Svaki dan analiziramo različite programske jezike.",
          "memes": "Svake srijede slavimo <b>'It’s Wednesday, my dudes'</b>, a petkom je <b>'Friday Day'</b> – dan kada pretplatnici u komentarima dijele svoje memeove. Da, samo petkom! Inače će biti 'uhićeni' :)",
          "qween": "Pretplatnici su me počeli zvati <b>'Queen of Dudes'</b>, neizmjerno mi zahvaljuju i šalju ljubavna pisma zbog toga što smo stvorili ovo nevjerojatno mjesto.",
          "people": "Kanal je ujedinio ne samo početnike već i iskusne programere koji programiraju na različitim jezicima. Među pretplatnicima ima i studenata koji tek uče. Također, unatoč temi kanala, tu su ljudi iz različitih struka koji jednostavno uživaju u gledanju memova i komunikaciji, dok nekima moje iskustvo služi kao <b>motivacija za promjene u životu</b>.",
          "stickers": "Krajem 2023. napravila sam set naljepnica s likom svog psa. Moj Oski postao je ambasador kanala i omiljen među korisnicima, doslovno je stekao fanove. To se pokazalo kao izuzetno uspješan potez; do danas je više od <b>tisuću korisnika</b> Telegrama instaliralo naljepnice koje su korištene preko 27 tisuća puta - i to u manje od šest mjeseci!"
        },
        "Doggy": {
          "name": "groundhopper",
          "groundhopping": "groundhopping",
          "description": "nogometno putovanje",
          "top": "top 100 rusija",
          "slogan": "slogan",
          "dog": "«Oprostite, što sam postao groundhopper? Zato što nisam imao psa!»",
          "gh": "Za početak, objasnit ću što je to <b>groundhopping</b>.",
          "beer": "Njemački čitatelji moje stranice bi vam rekli da to ide uz pivo i kobasice!",
          "stadiums": "Groundhopping je vrsta nogometnog putovanja koja ne favorizira niti jedan klub. Kada biraju utakmicu, takvi putnici obično gledaju koliko će utakmica biti zanimljiva: hoće li biti navijača koji pjevaju, hoće li povijest kluba biti fascinantna, te, naravno, ljepota samog stadiona.",
          "football": "Sam nogomet često nije glavna atrakcija, iako znam za groundhoppere koji zaista gledaju svaku minutu utakmice i pažljivo prate igru :)",
          "club": "To je logično, na kraju krajeva, svi smo se okupili zbog ljubavi prema nogometu, pa intuitivno počneš navijati za onaj klub koji ti se više svidi.",
          "groundhopper": "Odakle dolazi groundhopper",
          "tired": "Obično je to nogometni navijač koji je proveo godine putujući gradovima i zemljama za svoj klub, a svako takvo putovanje postalo je rutinski i nezanimljivo.",
          "cities": "Ništa se ne mijenja svake godine: Sankt Peterburg, Tula, Rostov, Samara, Kazan...",
          "hobby": "Volim svaki od tih gradova, ali u njima više nemam što novo vidjeti. Tako sam otkrila novu aktivnost vezanu za svoj omiljeni hobi - <b>groundhopping</b>.",
          "loko": "Prije nekoliko godina, krenula sam u Sankt Peterburg navijati za svoj Lokomotiv, a vratila sam se s Lokomotivove utakmice u Khimkiju, bez posjeta Moskvi (u biti, dvostruki izlet).",
          "matches": "Tijekom tog putovanja, prisustvovala sam <b>deset nogometnih utakmica</b> u Leningradskoj i Tverskoj oblasti.",
          "book": "Moj članak o jednoj od tih utakmica objavljen je u knjizi o groundhoppingu.",
          "stat": "Do danas sam posjetila više od <b>stotinu</b> jedinstvenih nogometnih stadiona i nalazim se među <b>sto</b> najboljih groundhoppera u Rusiji. Godine 2021. pridružila sam se Ruskoj Groundhopper ligi.",
          "buy": "Ali kao što je moj bivši šef rekao <b>«Žena je kupila svinju!»</b>(je to izreka u Rusiji koja znači da žena koja je živjela bez problema sama sebi stvara značajne poteškoće koje su se mogle izbjeći)",
          "fox": "U kolovozu 2023. postala sam ponosna vlasnica male crvene lisice. I od tada su moja putovanja poprimila nove boje.",
          "meet": "Brzo sam počela uvoditi Oscara u nogomet. Za Oskija sam napravila profil na web stranici groundhopper.ru i započela je nova potraga.",
          "dogFriendly": "Sada moram razmatrati ne samo prethodno navedene faktore pri odabiru utakmica, već se moram fokusirati i na stadione prijateljske prema psima, kojih, nažalost, gotovo da i nema.",
          "metallist": "Prva utakmica u Oscarovom životu bila je na stadionu Metalista u gradu Korolev. Unatoč znakovima koji zabranjuju prisustvo pasa, Oski je slobodno ušao na stadion i uživao u nogometu.",
          "belarus": "Moj hobi postao je još uzbudljiviji. Imam idealnog psa za putovanja, a Oski je već bio sa mnom na putovanju u susjednu Bjelorusiju.",
          "like": "Najnevjerojatnije je što vidim da se mojoj lisici sve to jako sviđa.",
          "more": "Dalje više!"
        },
        "Croatia": {
          "name": "cilj",
          "like": "svida",
          "goal": "Preseljenje u Hrvatsku",
          "climate": "Klima, ljudi i nogomet",
          "love": "Prvi put sam posjetila Hrvatsku 2016. godine i od tada sam se zaljubila u ovu zemlju. Oduševljava me klima u Hrvatskoj, mentalitet ljudi i njihova strast prema nogometu. Osjećam da mi je Hrvatska kao stvorena.",
          "zg80": "Godine 2020. <b>prevela sam s hrvatskog na ruski</b> film \"ZG80\" koji govori o odlasku navijača zagrebačkog Dinama na utakmicu u Srbiju protiv Crvene zvezde.",
          "friends": "Tijekom godina stekla sam prijatelje u Zagrebu, Splitu, Osijeku i Dubrovniku. <b>Naučila sam hrvatski</b>, čak i s profesorom.",
          "twitter": "Na Twitteru sam se sprijateljila s nogometnim klubom Lokomotiva Zagreb, a SMM menadžer kluba lajkao je moje objave o Lokomotivi :)",
          "dreams": "U 2023. godini odlučila sam se aktivnije angažirati, ali su mi planove poremetile poteškoće u svijetu u traženju posla u Hrvatskoj.",
          "work": "U veljači 2024. prijavila sam se na natječaj za poziciju Frontend developera u IT tvrtki iz Zagreba. Tehnološki zahtjevi bili su idealni za moje vještine. Nakon nekoliko dana stigao mi je poštom ugovor o tajnosti podataka i <b>poziv na razgovor za posao</b>.",
          "happy": "Bila sam iznimno sretna i pripremala sam se danonoćno. Mogla sam na hrvatskom razgovarati o event-loopu, zatvaranjima i mnogim drugim temama.",
          "interview": "Intervju je bio vrlo zanimljiv. Razgovarali smo o mom iskustvu, tehnologijama i postavljena su mi i psihološka pitanja. Trajao je 40 minuta i bio je na hrvatskom jeziku. Na kraju me osoba iz ljudskih resursa pohvalila, ali ju je zbunilo to što živim u Rusiji te da bi moj preseljenje moglo trajati četiri mjeseca, prema njezinom iskustvu. Nažalost, dobila sam odbijenicu.",
          "sad": "Bila sam jako uzrujana, ali sam odlučila nastaviti pokušavati. Dok sam tražila posao, već sam našla stan u Zagrebu blizu stadiona Lokomotive, no ispostavilo se da je teško naći posao u Hrvatskoj."
        }
      }
    }
  }
}
