{
  "ru": {
    "translation": {
      "main": {
        "hello": "КАТЯ МАРЧЕНКО",
        "katya": "Katya",
        "frontendDeveloper": "FRONTEND DEVELOPER",
        "welcome": "Приветствую вас на моем сайте-визитке.",
        "im": "Я фронтенд-разработчик, который любит создавать что-то новое и необычное.",
        "more": "подробнее",
        "talk": "поболтаем?"
      },
      "header": {
        "aboutMe": "Обо мне",
        "contacts": "Контакты",
        "projects": "Проекты",
        "pet": "Личные проекты"
      },
      "drawer": {
        "myHome": "Комната",
        "settings": "Настройки",
        "changeTheme": "Выберите тему"
      },
      "footer": {
        "info": "Я работаю в сфере разработки уже пять лет и с каждым проектом я стараюсь внедрять новые технологии и следить за актуальными трендами в индустрии, что помогает мне оставаться на передовой инновационных решений."
      },
      "work": {
        "position": "позиция",
        "period": "период",
        "сфера": "сфера",
        "title": "Основные достижения и обязанности:",
        "ic8": {
          "position": "Старший программист",
          "first": "Разработан новый продукт \"Админка\" по управлению тарифами и online-тарификации",
          "second": "Доработан продукт сервисных заявок и управления бригадами",
          "third": "Разработана новая web-версия продукта по использованию тарифных планов широкополосного интернета с внедрением технологии Tanstack Query"
        },
        "fgk": {
          "position": "Программист",
          "first": "Разработка и дизайн пользовательских интерфейсов для кабинетов менеджеров и клиентов, с использованием Vue.js.",
          "second": "Реализовала адаптивный, интуитивно понятный дизайн, улучшающий пользовательский опыт и повышающий производительность работы менеджеров.",
          "third": "Самостоятельная разработка и оптимизация бэкенда. Улучшила архитектуру серверной части, оптимизировала запросы к базе данных и API, обеспечив высокую производительность и надёжность системы.",
          "fourth": "Создание интегрированной разработческой среды (IDE) с помощью Vue.js для внутреннего использования командой менеджеров. Эта платформа позволила ускорить процесс расчетов."
        },
        "qwep": {
          "position": "Frontend-разработчик",
          "first": "Полная переработка и запуск новой веб-версии платформенных приложений, выполненная в команде с коллегой-разработчиком. Проект включал переписывание приложений с нуля, что обеспечило улучшенную производительность, современный пользовательский интерфейс и более высокую масштабируемость системы.",
          "second": "Разработка дополнительного функционала для приложений в качестве продолжающейся."
        }
      },
      "aboutMe": {
        "name": "Имя:",
        "Ekaterina": "Екатерина",
        "city": "Город:",
        "Moscow": "Москва",
        "education": "Образование:",
        "higher": "Высшее",
        "years": "Возраст:",
        "zodiac": "Знак зодиака:",
        "capricorn": "Козерог",
        "spec": "Специализация:",
        "programer": "Программист"
      },
      "card": {
        "ic8": "Айси Эйт",
        "sphere": "Сфера:",
        "whatDoing": "Что делала:",
        "ic8Do": "в 2024 году разрабатывала приложение для технических специалистов по упавлению бригадами, запустили новую web-версию продукта по использованию широкополосного интернета",
        "fgk": "Федеральная грузовая компания",
        "fgkDo": "разрабатывала кабинеты менеджеров и клиентов, самостоятельно дорабатывала бэк. Я открыла для себя Vue в коммерческой разработке, написала с помощью него IDE.",
        "qwep": "квэп",
        "qwepDo": "в 2023 году мы переписали приложения платформы с нуля и успешно запустили новую web-версию. продолжаю разрабатывать функционал приложений QWEP в дополнение к основной работе."
      },
      "story": {
        "work": "«Ты знаешь, что ты будешь мега сеньоркой»",
        "kanal": "С 2022 году запустила уникальнейший IT-канал «Что-то на джуновском»",
        "shiba": "Правительница здешних цифровых земель и лисица",
        "croatia": "Основная жизненная цель — переезд в Хорватию",
        "Work": {
          "start": "Вспоминая начало своего пути, стоит упомянуть, что я родилась в Москве в пятницу 13-го и всё детство провела, занимаясь компьютерами вместе с братьями. Старший из нас — преподаватель информатики, младший — инженер по информационной безопасности.",
          "education": "В школе училась <b>в физико-математическом классе</b>. Высшее образование получила в Российском университете кооперации защитив диплом на отлично. Сейчас заочно учусь на магистратуре.",
          "js": "Также успешно прошла обучение в школе программирования, выпустившись с дипломом <b>JavaScript разработчика</b>.",
          "frontend": "На текущий день <b>занимаюсь разработкой около пяти лет</b>. С удовольствием берусь за дополнительные проекты и постоянно развиваюсь.",
          "lib": "Мой первый личный проект — это была электронная библиотека. В процессе поиска работы нужно было себя чем-то занять, и я начала писать.",
          "friend": "Идею подкинули подружки:",
          "whantLib": "«Хочется выкладывать свои книги онлайн и также бронировать!».",
          "app": "Приложение позволяло зарегистрироваться, выложить собственную книгу в общий доступ, найти и забронировать интересующую. К книге можно было написать комментарий или же просто оставить оценку.",
          "deploy": "Самостоятельно разработала дизайн. Создала интерфейс без использования UI библиотек. Подключила базу данных, выкатила проект на heroku и вуаля.",
          "offer": "Первый оффер в кармане!",
          "dontStop": "Не остановившись на достигнутом я продолжала изучать новые технологии и создавать классные штуки.",
          "fgk": "Одним из интересных и важных для меня опытов стала работа в <b>Федеральной грузовой компании</b>.",
          "backend": "В ФГК я разрабатывала кабинеты менеджеров и клиентов и мне посчастливилось изучить PHP и Laravel и <b>самостоятельно дорабатывать бэк</b>.",
          "vue": "Я открыла для себя Vue в коммерческой разработке, написала с помощью него IDE.",
          "qwep": "Сейчас я вернулась к React и помимо основной работы продолжаю помогать разрабатывать функционал приложения QWEP. В 2023 году мы переписывали приложения с нуля и успешно выкатили ",
          "newWeb": "новую WEB-версию."
        },
        "Kanal": {
          "kanal": "Как бы оно громко не звучало, но самое важное, что у меня сейчас есть — это мой канал. Мое детище!",
          "save": "Однажды я придумала вести заметки в телеграме. Создала для себя канал и сохраняла туда полезные IT-ссылки, статьи, интересные проекты. Делала для себя какие-то сноски, писала комментарии.",
          "story": "Внезапно обнаружила, что канал начинает набирать подписчиков и решила в тот момент, что в процессе получения опыта буду туда же записывать свои истории, достижения и события из жизни на работе.",
          "qweez": "К отметке <b>500 подписчиков</b> аудитория канала стала абсолютно понятна, и даже сформировалось некое коммьюнити. У нас появились локальные мемы, мы стали проводить квизы на канале, в том числе и от подписчиков, появились викторины, мы каждый день изучаем разные языки программирования.",
          "memes": "Каждую среду у нас <b>It's Wednesday, my dudes</b>, а в пятницу <b>Friday</b> — день, когда подписчики присылают в комментарии свои мемы. Да-да, только в пятницу! Иначе будут арестованы :)",
          "qween": "Подписчики стали называть меня <b>Королевой дудесов</b>, бесконечно благодарить и писать письма любви за то, что у нас есть это потрясающее место.",
          "people": "Канал объединил в себя не только джуниоров, но и опытных программистов, пишущих на самых разных языках. Среди подписчиков есть студенты, которые только учатся. Также несмотря на тематику канала здесь присуствуют люди из совершенно разных сфер, которым просто интересно смотреть мемы и общаться, а для некоторых мой опыт является <b>мотивацией для перемен в жизни</b>.",
          "stickers": "В конце 2023 года я создала стикерпак со своим щеняткой. Мой Оски стал амбассадором канала и всеобщим любимцем, у него буквально стали появляться фанаты. И это стало настолько удачной разработкой, что на текущий день стикеры установили себе <b>более тысячи пользовтелей</b> телеграма, а использовали их более <b>27 тысяч раз</b> — и это менее, чем за пол года!"
        },
        "Doggy": {
          "dog": "«Извините, я почему граундхоппером был — потому что у меня собаки не было!»",
          "gh": "Давайте начнем с того, что вообще это такое — <b>граундхоппинг</b> и счем его едят.",
          "beer": "Немецкие читатели моего сайта сейчас бы вам сказали: с пивом иколбасками!",
          "stadiums": "Граундхоппинг — это футбольные путешествия без привязки к конкретному клубу. В выборе матча такие путешественники как правило отталкиваются от того, насколько интересная будет игра: будут ли у команд болельщики, чтобы послушать их песни, увлекательна ли история клуба, ну и конечно красота самого стадиона.",
          "football": "Сам футбол в такой истории мало кого интересует, но я знакома с граундхопперами, которые действительно смотрят матч с первой до последней минутки и оценивают саму игру и переживают :)",
          "club": "Это и логично, все-таки все мы собрались по одному поводу — футбол, поэтому интуитивно на один часик начинаешь «притапливать» за более симпотичный тебе клуб.",
          "groundhopper": "Откуда берется граундхоппер?",
          "tired": "Как правило это футбльный болельщик, который на протяжении своей жизни объездил за своим клубом множество городов и стран и каждый выезд уже стал утомительным и неинтересным.",
          "cities": "Каждый год ничего не меняется: Питер, Тула, Ростов, Самара, Казань...",
          "hobby": "Мне очень нравится каждый из этих городов, но мне уже просто нечего в них смотреть. Вот так и придумывается себе новое занятие связанное с любимым увлечением — <b>граундхоппинг</b>.",
          "loko": "Пару лет назад я поехала на выезд за свой Локомотив в Санкт-Петербург, а вернулась на игру Локо в Химки без заезда в Москву (по сути двойник).",
          "matches": "За эту поездку я посетила <b>10 футбольных матчей </b>по Ленинградской и Тверской областям.",
          "book": "Моя статья про один из этих матчей была напечатана в книге по граундхоппингу.",
          "stat": "На сегодняшний день я посетила <b>более ста уникальных футбольных стадионов</b> с матчами на них, и я вхожу в <b>топ 100</b> граундхопперов России. В 2021 году я присоединилась к Русской лиге граундхопперов.",
          "buy": "Но! Как выразился мой бывший руководитель <b>«Купила баба порося!»</b>",
          "fox": "В августе 2023 я стала счастливой обладательницей маленькой рыжей лисицы. И на этом мои путешествия заиграли новыми красками.",
          "meet": "В кратчайшие сроки я начала знакомить Оскара с футболом. Создала Оски аккаунт на сайте groundhopper.ru и начался новый квест.",
          "dogFriendly": "Теперь мне нужно отталкиваться не только от вышеупомянутых фактров при выборе игры, а еще ориентироваться на <b>Dog Friendly</b> стадионы, а таких, к сожалению, практически нет :(",
          "metallist": "Первым матчем в жизни Оскара стала игра Металлиста из города Королёв. Несмотря на развешанные по всему стадиону таблички о запрете посещения игр собаками, Оски попал на территорию свободно и смог посмотреть футбол.",
          "belarus": "Мое хобби стало еще увлекательнее. У меня идеальная для путешествий собака, и Оски уже съездил со мной в соседнюю страну — Беларусь.",
          "like": "Самое потрясающее, что я вижу, что моей лисице это все очень нравится.",
          "more": "Дальше — больше!"
        },
        "Croatia": {
          "love": "Первый раз я приехала в Хорватию в 2016 году и с того момента влюбилась в эту страну. Мне безумно нравится климат Хорватии, менталитет этих людей, их любовь к футболу. Страна очень мне подходит.",
          "zg80": "В 2020 году я <b>перевела с хорватского языка на русский</b> фильм ZG80, про выезд фанатов Динамо Загреб в Сербию на игру с Црвеной Звездой.",
          "friends": "За все эти годы у меня появились друзья в Загребе, Сплите, Осиеке, Дубровнике. <b>Я выучила хорватский язык</b>, даже занималась с репетитором.",
          "twitter": "В твиттере я подружилась с футбольным клубом Локомотивой Загреб, и СММ-менеджер с аккаунта клуба лайкал мои посты про Локомотиву :)",
          "dreams": "В 2023 году я приняла решение активно заняться переездом, но мои планы разбились о поиск работы в Хорватии.",
          "work": "В феврале 2024 года я откликнулась на вакансию Frontend-разработчика одной IT-компании из Загреба. Требуемый стек технологий идеально подходил под мой. Через пару дней на почту мне пришло соглашение о неразглашении и <b>приглашение на собеседование</b>",
          "happy": "Я была безумно счастлива и готовилась буквально днями и ночами. Я смогла на хорватском рассказать и про event-loop, про замыкания, про все на свете.",
          "interview": "Это было очень интересное собеседование. Мы разговаривали о моем опыте, о технологиях, были психологические вопросы. Все собеседование длилось 40 минут, и оно было на хорватском языке. В конце HR меня очень похвалила, но ее смутило, что я в России, и что мой переезд может занять по ее опыту 4 месяца. Мне пришел отказ.",
          "sad": "Я очень расстроилась, но решила, что буду стараться дальше. На момент поиска работы я уже нашла жилье в Загребе около стадиона Локомотивы, но работу в Хорватии оказалось непросто найти"
        }
      }
    }
  }
}
